Autodesk.Revit.DB.NumberingParameter.CanBeNumberingOutputParameter(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Checks if the parameter value can be used with a set of categories and a given schema.
document:
Revit Document.
categories:
Set of categories for the parameter.
Returns:
Returns true if the parameter can be a numbering output parameter for the input categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.NumberingParameter.NumberingParameterType
The type for numbering parameter association.

Autodesk.Revit.DB.NumberingParameter.ParameterId
The id of the parameter.

Autodesk.Revit.DB.NumberingParameter.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.NumberingParameterType)
Create a new parameter with association based on a parameter id and an association type.
parameterId:
The parameter id for the target parameter.
numberingParameterType:
The target for the associated parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for NumberingParameterType.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.NumberingParameter
Defines a parameter and its source based on associations.